code-review/NRB_3471_3546/База_Было/Documents/ОперацииЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацииЦБ</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
				<xr:Item>Document.ЦБВПути</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБДепозитарийМХ</xr:Item>
				<xr:Item>AccumulationRegister.ЗаблокированныеЦБвВышестоящемДепозитарии</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБМестоРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокировочныйРазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВДепозитарииМХ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВМестеРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВстречный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторВстречный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиОснования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыНаDMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/ОстаткиЦБМестоРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБМестоРасчетов</Name>
			<Comment>Остатки ЦБ по дате исполнения в месте расчетов</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ПараметрыГлобальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыГлобальные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/ЗаблокированныеЦБвВышестоящемДепозитарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаблокированныеЦБвВышестоящемДепозитарии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БлокировочныйРазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/КлассыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КлассыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Административные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глобальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплексные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСчетовДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОткрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ОперацииЦБ/Ext/ObjectModule.bsl
Перем КолСписЦБСОбрем;		// Количество ЦБ с обременением для списания
Перем ВидыОпераций;
Перем ЗаблокированноеКоличествоЦБ;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ЗначениеЗаполнено(БлокировочныйРазделСчетаДепо)
		Или РазделСчетаДепо.ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты 
	Тогда
		ЗаблокированноеКоличествоЦБ = ЗаблокированноеКоличествоЦБ();
	Иначе
		ЗаблокированноеКоличествоЦБ = 0;
	КонецЕсли;
	
	Отказ = ЕстьОшибки();
	
	// Проконтроллируем не был ли это документ приемки / снятия ЦБ на обслуживании ранее и если да, то уберем старые движения
	Если (Ссылка.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание
			ИЛИ Ссылка.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания)
		И Ссылка.Проведен Тогда
		УдалитьСтарыйДвиженияПримекиСнятияОбслуживания();
	КонецЕсли;	
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЦБВПути") Тогда
		Если ВидОперацииД = ВидыОпераций.Депонирование ИЛИ ВидОперацииД = ВидыОпераций.НачислениеДоходовЦБ Тогда
			Движение 					= Движения.ЦБВПути.ДобавитьРасход();
			Движение.Период 			= Дата;
			Движение.СчетДепо 			= СчетДепо;
			Движение.РазделСчетаДепо 	= РазделСчетаДепо;
			Движение.ЦБ 				= ЦБ;
			Движение.СчетДепоМХ 		= СчетДепоМХ;
			Движение.РазделСчетаДепоМХ 	= РазделСчетаДепоМХ;
			Движение.Количество 		= Количество;
			
			ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Приход, Перечисления.СтатусыЦБ.Свободна, Количество);
				
		ИначеЕсли ВидОперацииД = ВидыОпераций.СнятиеСДепонирования Тогда
			Движение 					= Движения.ЦБВПути.ДобавитьРасход();
			Движение.Период 			= Дата;
			Движение.СчетДепо 			= СчетДепо;
			Движение.РазделСчетаДепо 	= РазделСчетаДепо;
			Движение.ЦБ 				= ЦБ;
			Движение.СчетДепоМХ 		= СчетДепоМХ;
			Движение.РазделСчетаДепоМХ 	= РазделСчетаДепоМХ;
			Движение.Количество 		= Количество;
			
		ИначеЕсли ВидОперацииД 	= ВидыОпераций.Перевод
			ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
			ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			Движение 					= Движения.ЦБВПути.ДобавитьРасход();
			Движение.Период 			= Дата;
			Движение.СчетДепо 			= СчетДепоПолучатель;
			Движение.РазделСчетаДепо 	= РазделСчетаДепоПолучатель;
			Движение.ЦБ 				= ЦБ;
			Движение.СчетДепоМХ 		= СчетДепоМХПолучатель;
			Движение.РазделСчетаДепоМХ 	= РазделСчетаДепоМХПолучатель;
			Движение.Количество 		= Количество;
			
			ДобавитьДвиженияВОстаткиЦБПолучатель(ВидДвиженияНакопления.Приход, Перечисления.СтатусыЦБ.Свободна,
				Количество);
		КонецЕсли;
		
	Иначе
		Если ВидОперацииД = ВидыОпераций.Депонирование ИЛИ 
			ВидОперацииД = ВидыОпераций.НачислениеДоходовЦБ Тогда
			ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Приход, Перечисления.СтатусыЦБ.Свободна, Количество);
			
		ИначеЕсли ВидОперацииД = ВидыОпераций.СнятиеСДепонирования Или ВидОперацииД = ВидыОпераций.Выкуп Тогда
			
			Если ВидОперацииД = ВидыОпераций.СнятиеСДепонирования И РасчетыНаDMA Тогда
				
				ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, Перечисления.СтатусыЦБ.Свободна, Количество - ЗаблокированноеКоличествоЦБ, , РазделСчетаДепо);
				Если ЗаблокированноеКоличествоЦБ > 0 Тогда
					ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, Перечисления.СтатусыЦБ.Свободна, ЗаблокированноеКоличествоЦБ, , БлокировочныйРазделСчетаДепо);
				КонецЕсли;
				
			Иначе
				Если Количество > КолСписЦБСОбрем Тогда
					ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, Перечисления.СтатусыЦБ.Свободна,
						Количество - КолСписЦБСОбрем);
				КонецЕсли;
				
				Если КолСписЦБСОбрем > 0 Тогда
					ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, Перечисления.СтатусыЦБ.Обременена,
						КолСписЦБСОбрем);
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ВидОперацииД = ВидыОпераций.Перевод
			ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
			ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
			
			Если Количество > КолСписЦБСОбрем Тогда
				ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, Перечисления.СтатусыЦБ.Свободна,
					Количество - КолСписЦБСОбрем);
			КонецЕсли;
			
			Если КолСписЦБСОбрем > 0 Тогда
				ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, Перечисления.СтатусыЦБ.Обременена,
					КолСписЦБСОбрем);
			КонецЕсли;
			
			ДобавитьДвиженияВОстаткиЦБПолучатель(ВидДвиженияНакопления.Приход, Перечисления.СтатусыЦБ.Свободна,
				Количество);
				
		ИначеЕсли 	ВидОперацииД = ВидыОпераций.Блокирование 		ИЛИ
			ВидОперацииД = ВидыОпераций.ВозвратИзЗалога 	ИЛИ
			ВидОперацииД = ВидыОпераций.Обременение			ИЛИ
			ВидОперацииД = ВидыОпераций.ПередачаВЗалог 		ИЛИ
			ВидОперацииД = ВидыОпераций.Разблокирование 	ИЛИ
			ВидОперацииД = ВидыОпераций.СнятиеОбременения	Тогда
			
			СтатусРасход = СтатусПоВидуОперации("РАСХОД",ВидОперацииД);		
			СтатусПриход = СтатусПоВидуОперации("ПРИХОД",ВидОперацииД);		
			
			Если Количество > КолСписЦБСОбрем Тогда
				ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, СтатусРасход, Количество - КолСписЦБСОбрем);
			КонецЕсли;
			
			Если КолСписЦБСОбрем > 0 Тогда
				ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Расход, Перечисления.СтатусыЦБ.Обременена, КолСписЦБСОбрем);
			КонецЕсли;
			
			Если ВидОперацииД = ВидыОпераций.ВозвратИзЗалога
				ИЛИ ВидОперацииД = ВидыОпераций.ПередачаВЗалог Тогда
				
				ДобавитьДвиженияВОстаткиЦБПолучатель(ВидДвиженияНакопления.Приход, СтатусПриход, Количество);
			Иначе
				ДобавитьДвиженияВОстаткиЦБ(ВидДвиженияНакопления.Приход, СтатусПриход, Количество);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	// Записываем движения регистров
	ЗаписатьДвиженияОстатковЦБ();
	Движения.ЦБВПути.Записать();
	
	Если НЕ(Контрагент = Справочники.Биржи.MICEX ИЛИ НЕ(ЗначениеЗаполнено(Контрагент))) Тогда
		РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(
			Дата,
			Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПО.Код),7)),
			Новый Структура("Операция, МестоХранения1, МестоХранения2",				
				ВидОперацииД,
				
				?(ВидОперацииД = ВидыОпераций.Депонирование
					ИЛИ ВидОперацииД = ВидыОпераций.СнятиеСДепонирования
					ИЛИ ВидОперацииД = ВидыОпераций.Перевод
					ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
					ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо,
				МестоХранения, Неопределено),
				
				?(ВидОперацииД = ВидыОпераций.Депонирование
					ИЛИ ВидОперацииД = ВидыОпераций.СнятиеСДепонирования
					ИЛИ ВидОперацииД = ВидыОпераций.Перевод
					ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
					ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо,
				МестоХраненияПолучатель, Неопределено)
				)
			);
		Если РасчетныеПараметры <> Неопределено Тогда
			Движение = Движения.УслугиДепозитария.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Инициатор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПО.Код),7));
			Движение.МестоХранения = МестоХранения;
			Движение.Услуга = РасчетныеПараметры.Услуга;
			Движение.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
			Движение.Валюта = РасчетныеПараметры.Валюта;
			Движение.Сумма = РасчетныеПараметры.Сумма;
			Движение.СуммаВВалюте = Конвертации.КонвертацияВалюты(Дата, Движение.Сумма, РасчетныеПараметры.Валюта);
			Движение.СуммаНДС = РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС, Движение.Сумма);
			Движение.СуммаВсего = РасчетТарифов.РТ_ОбщаяСумма(Движение.СтавкаНДС,Движение.Сумма,Движение.СуммаНДС);
			Движение.Сумма = Движение.СуммаВсего - Движение.СуммаНДС;
			Движение.ТипТарифа = РасчетныеПараметры.ТипТарифа;
			Движение.Тариф = РасчетныеПараметры.Тариф;
			Движения.УслугиДепозитария.Записать();
		КонецЕсли; 	
		Если ВидОперацииД = ВидыОпераций.Перевод Тогда
			РасчетныеПараметры = РасчетТарифов.РасчетСтоимостиУслуги(
				Дата,
				Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПОПолучатель.Код),7)),
				Новый Структура("Операция, МестоХранения1, МестоХранения2",
					ВидОперацииД, МестоХранения, МестоХраненияПолучатель));
			Если РасчетныеПараметры <> Неопределено Тогда
				Движение = Движения.УслугиДепозитария.ДобавитьПриход();
				Движение.Период = Дата;
				Движение.Инициатор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду(Лев(СокрЛП(СчетДЕПОПолучатель.Код),7));
				Движение.МестоХранения = МестоХраненияПолучатель;
				Движение.Услуга = РасчетныеПараметры.Услуга;
				Движение.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
				Движение.Валюта = РасчетныеПараметры.Валюта;
				Движение.Сумма = РасчетныеПараметры.Сумма;
				Движение.СуммаВВалюте = Конвертации.КонвертацияВалюты(Дата, Движение.Сумма, РасчетныеПараметры.Валюта);
				Движение.СуммаНДС = РасчетТарифов.РТ_РасчетНДС(Движение.СтавкаНДС, Движение.Сумма);
				Движение.СуммаВсего = РасчетТарифов.РТ_ОбщаяСумма(Движение.СтавкаНДС,Движение.Сумма,Движение.СуммаНДС);
				Движение.Сумма = Движение.СуммаВсего - Движение.СуммаНДС;
				Движение.ТипТарифа = РасчетныеПараметры.ТипТарифа;
				Движение.Тариф = РасчетныеПараметры.Тариф;
				Движения.УслугиДепозитария.Записать();
			КонецЕсли; 	
		КонецЕсли;
	КонецЕсли; 	
	
	Если ВидОперацииД = ВидыОпераций.Перевод Тогда
		ЗаполнитьДатыИсполненияВПоручении(ДокументОснование, Отказ);
	КонецЕсли;
	
	Документы.СводныйОтчетОСовершенныхОперациях.ИсполнитьПоручениеВыпиской(Ссылка);
	
	Если ВидОперацииД = ВидыОпераций.Перевод Тогда
		ЗаполнитьДатыИсполненияВПоручении(ДокументОснованиеВстречный, Отказ);
		ЭтоВстречноеИсполнение = Истина;
		Документы.СводныйОтчетОСовершенныхОперациях.ИсполнитьПоручениеВыпиской(Ссылка, , ЭтоВстречноеИсполнение);
	КонецЕсли;
	
	// Движения по справочнику ЦБ при Снятии или Приемке ЦБ на обслуживание
	Если ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		Если ЗначениеЗаполнено(ЦБ.ДатаСнятияСОбслуживания) И (ЦБ.ДатаСнятияСОбслуживания < Дата) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Невозможно принять на обслуживание бумаги, которые были сняты с обслуживания ранее!!!", Отказ);
			Возврат;
		ИначеЕсли ЗначениеЗаполнено(ЦБ.ДатаПриемаНаОбслуживание) И (НЕ ЦБ.ДокументПриемаНаОбслуживание = Ссылка) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Невозможно принять бумаги на обслуживание повторно!!!", Отказ);
			Возврат;
		КонецЕсли;
		ЦБОбъект	= ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаПриемаНаОбслуживание		= Дата;
		ЦБОбъект.ДокументПриемаНаОбслуживание	= Ссылка;
		ЦБОбъект.Записать();
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		Если ЗначениеЗаполнено(ЦБ.ДатаСнятияСОбслуживания) И (НЕ ЦБ.ДокументСнятияСОбслуживания = Ссылка) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Невозможно снять с обслуживания бумаги, которые уже были сняты с обслуживания!!!", Отказ);
			Возврат;
		КонецЕсли;
		ЦБОбъект	= ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаСнятияСОбслуживания		= Дата;
		ЦБОбъект.ДокументСнятияСОбслуживания	= Ссылка;
		ЦБОбъект.Записать();
	КонецЕсли;	
	
	СформироватьДвиженияПоРегиструЗаблокированныеЦБ(Отказ);
	
	Если Документы.Поручение.ЭтоИнвентарноеПоручениеСИсполнениемВРежимеЧастичногоИсполнения(ДокументОснование) Тогда
		ДанныеИсполнения = Документы.ИсполнениеПоручения.ДанныеИсполненияПоручения(ДокументОснование);
		Если ЗначениеЗаполнено(ДанныеИсполнения.Статус) Тогда
			РегистрыСведений.СтатусыПоручений.УстановитьСтатус(Движения, ДокументОснование, Дата, ДанныеИсполнения.Статус, Количество);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		ОтключитьЗаполнениеПризнакаНачислитьКомиссию =
			ДополнительныеСвойства.Свойство("ОтключитьЗаполнениеПризнакаНачислитьКомиссию")
			И ДополнительныеСвойства.ОтключитьЗаполнениеПризнакаНачислитьКомиссию = Истина;
		Если Не ОтключитьЗаполнениеПризнакаНачислитьКомиссию Тогда
			Документы.Поручение.УстановитьПризнакНачислитьКомиссиюДепо(ДокументОснование, Ссылка);
			Если ЗначениеЗаполнено(ДокументОснованиеВстречный) Тогда
				Документы.Поручение.УстановитьПризнакНачислитьКомиссиюДепо(ДокументОснованиеВстречный, Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.иц_СводноеПоручение") Тогда
		ЭтоПерепроведение = РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.Проведен;
		ЭтоОтменаПроведения = РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И Ссылка.Проведен;
		
		Если ЭтоПерепроведение Или ЭтоОтменаПроведения Тогда
			ТекстСообщения = "Повторное проведение или отмена проведения " + Ссылка + " запрещена, обратитесь в команду Поддержки!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперацииД <> ВидыОпераций.СнятиеЦБсОбслуживания И ВидОперацииД <> ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		Если Не ЗначениеЗаполнено(ВидОперацииД) Тогда
			Сообщить("Не выбран вид операции",СтатусСообщения.Важное);  
			Отказ = Истина;			
		ИначеЕсли ВидОперацииД.КлассОпераций<>Перечисления.КлассыОпераций.ПустаяСсылка() Тогда
			КлассОпераций = ВидОперацииД.КлассОпераций;
		КонецЕсли;	    
		
		Если Не ЗначениеЗаполнено(СчетДепоМХ) Тогда
			Сообщить("Не выбран счет депо хранилища",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СчетДепо) Тогда
			Сообщить("Не выбран счет депо депонента",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	     
		
		Если Не ЗначениеЗаполнено(РазделСчетаДепоМХ) Тогда
			Сообщить("Не выбран раздел счета депо хранилища",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	                                        
		
		Если Не ЗначениеЗаполнено(РазделСчетаДепо) Тогда
			Сообщить("Не выбран раздел счета депо депонента",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Инициатор) Тогда
			Сообщить("Не выбран депонент",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(МестоХранения) Тогда
			Сообщить("Не выбрано хранилище",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ЦБ) Тогда
			Сообщить("Не выбрана ценная бумага",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Количество) Тогда
			Сообщить("Не задано количество",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперацииД = ВидыОпераций.Перевод
		ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		Если Не ЗначениеЗаполнено(Получатель) Тогда
			Сообщить("Не выбран депонент-получатель",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(СчетДепоПолучатель) Тогда
			Сообщить("Не выбран счет депо получателя",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(РазделСчетаДепоПолучатель) Тогда
			Сообщить("Не выбран раздел счета депо получателя",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(МестоХраненияПолучатель) Тогда
			Сообщить("Не выбрано хранилище получателя",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(СчетДепоМХПолучатель) Тогда
			Сообщить("Не выбран счет депо хранилища получателя",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(РазделСчетаДепоМХПолучатель) Тогда
			Сообщить("Не выбран раздел счета депо хранилища получателя",СтатусСообщения.Важное);  
			Отказ = Истина;			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ВидОперацииД = ВидыОпераций.Перевод Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОснованиеВстречный) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не выбран документ-основание (встречный)!", Отказ);
		КонецЕсли;		
		
		Если НЕ ЗначениеЗаполнено(ИнициаторВстречный) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не выбран Инициатор (встречный)!", Отказ);
		КонецЕсли;	
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			УстановитьНовыйНомер();	
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Основание) И ЗначениеЗаполнено(ДокументОснование) Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	Если НЕ РучнойВвод Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	// Установим автора или ответственного за изменения документа
	Если Не ЭтоНовый() Тогда
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ВидОперацииД.ДвижениеПоЦБ Тогда
		Если НЕ ЗначениеЗаполнено(ДатаИсполненияВДепозитарииМХ)	ИЛИ НЕ ЗначениеЗаполнено(ДатаИсполненияВМестеРасчетов) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Необходимо указывать даты исполнения в депозитарии МХ и в месте расчетов!", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	БлокированоВЗалоге = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоВЗалоге;
	Если ВидОперацииД = ВидыОпераций.ПередачаВЗалог
		И РазделСчетаДепоПолучатель.ТипРазделаСчетаДЕПО <> БлокированоВЗалоге Тогда
			ОбщегоНазначения.СообщитьОбОшибке("При передаче в залог раздел счета депо получателя должен иметь тип '"
			+ БлокированоВЗалоге + "'", Отказ);
			Возврат;
	КонецЕсли;
	
	Если ВидОперацииД = ВидыОпераций.ВозвратИзЗалога
		И РазделСчетаДепо.ТипРазделаСчетаДЕПО <> БлокированоВЗалоге Тогда
			ОбщегоНазначения.СообщитьОбОшибке("При возврате из залога раздел счета депо депонента должен иметь тип '"
			+ БлокированоВЗалоге + "'", Отказ);
			Возврат;
	КонецЕсли;
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		CrmContractNumber = Справочники.КодыЗагрузки.НайтиПоВладельцуИБирже(Депонент, Справочники.КлассификаторыЗагрузки.CrmContractNumber);
		ИсключитьИзОбменаДанными = Не ЗначениеЗаполнено(CrmContractNumber);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОперациюНаОснованииПорученияИСвязатьПоручения(ДокОснование) Экспорт  
	
	ЗаполнитьОперациюНаОснованииПоручения(ДокОснование);
	
	ВстречноеПоручение = Документы.Поручение.ВстречноеПоручениеПеревод(ДокОснование);
	Если Не ЗначениеЗаполнено(ВстречноеПоручение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Встречное поручение не найдено и не будет заполнено");
		Если ТранзакцияАктивна()Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
	Иначе
		ЭтотОбъект.Основание = ДокОснование.Ссылка;
		ЭтотОбъект.ДокументОснованиеВстречный = ВстречноеПоручение.Ссылка;
		ЭтотОбъект.Основание = Строка(ДокОснование);
		ЭтотОбъект.НомерВходящегоПоручения = ДокОснование.Номер;
		Если Инициатор = ДокОснование.Депонент Тогда 
			ЭтотОбъект.ИнициаторВстречный = ДокОснование.Контрагент;
		Иначе 
			ЭтотОбъект.ИнициаторВстречный = ДокОснование.Депонент;
		КонецЕсли;
		
		Если ДокОснование.ДатаИсполненияПоручения <> Дата(1,1,1) 
			И ДокОснование.ДатаИсполненияПорученияВДепозитарииМХ <> Дата(1,1,1)
			И ДокОснование.ДатаИсполненияПорученияВМестеРасчетов <> Дата(1,1,1) Тогда 
			ДатаИсполненияПоручения = ДокОснование.ДатаИсполненияПоручения;
			ДатаИсполненияПорученияВДепозитарииМХ = ДокОснование.ДатаИсполненияПорученияВДепозитарииМХ;
			ДатаИсполненияПорученияВМестеРасчетов = ДокОснование.ДатаИсполненияПорученияВМестеРасчетов;
		Иначе 
			ДатаИсполненияПоручения = ВстречноеПоручение.ДатаИсполненияПоручения;
			ДатаИсполненияПорученияВДепозитарииМХ = ВстречноеПоручение.ДатаИсполненияПорученияВДепозитарииМХ;
			ДатаИсполненияПорученияВМестеРасчетов = ВстречноеПоручение.ДатаИсполненияПорученияВМестеРасчетов;
		КонецЕсли;

		
		Если ДокОснование.СчетДепоМХ = ДокОснование.СчетДепоМХКонтрагента И ДокОснование.РазделСчетаДепоМХ = ДокОснование.РазделСчетаДепоМХКонтрагента Тогда
	     	// Если перевод внутри ВТКБ датой исполнения будет дата ОперацииЦБ
			ДатаИсполненияПоручения = ТекущаяДатаСеанса();
			ЭтотОбъект.Дата = ДатаИсполненияПоручения;
			ЭтотОбъект.ДатаИсполненияВДепозитарииМХ = ДатаИсполненияПоручения;
			ЭтотОбъект.ДатаИсполненияВМестеРасчетов = ДатаИсполненияПоручения;
		ИначеЕсли ДатаИсполненияПоручения <> Дата(1,1,1) Тогда
			ЭтотОбъект.Дата = ДатаИсполненияПоручения;
			ЭтотОбъект.ДатаИсполненияВДепозитарииМХ = ДатаИсполненияПорученияВДепозитарииМХ;
			ЭтотОбъект.ДатаИсполненияВМестеРасчетов = ДатаИсполненияПорученияВМестеРасчетов;
		КонецЕсли
		
	
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьОперациюНаОснованииПоручения(Основание, ДанныеЦБ = Неопределено)
	
	Если Основание.ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Инвентарные
		ИЛИ Основание.ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Комплексные
		ИЛИ Основание.ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Глобальные
		Тогда 
		Дата = ?(ЗначениеЗаполнено(Основание.ДатаИсполненияПоручения), Основание.ДатаИсполненияПоручения, Основание.Дата);
		ДокументОснование			= Основание.Ссылка;	
		НомерВходящегоПоручения		= Основание.ВходящийНомерПоручения;
		ВидОперацииД				= Основание.ВидОперацииД;
		Комментарий					= "Поручение № " + Основание.Номер + " от " + Основание.Дата;
		Инициатор					= Основание.Инициатор;
		Депонент					= Основание.СчетДепо.Владелец;
		СчетДепо					= Основание.СчетДепо;
		
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.Депонирование
			ИЛИ Основание.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
			РасчетыНаDMA = Основание.РасчетыНаDMA;
		Иначе
			РасчетыНаDMA = Ложь;
		КонецЕсли;
		
		Если Основание.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
			РазделСчетаДепо			= РазделСчетаДепоПоСтруктуреПодчиненностиПоручения(Основание);
			Если РазделСчетаДепо <> Основание.РазделСчетаДепо И РасчетыНаDMA Тогда
				БлокировочныйРазделСчетаДепо = РазделСчетаДепо;
				РазделСчетаДепо = Основание.РазделСчетаДепо;
			КонецЕсли;
		Иначе
			РазделСчетаДепо 		= Основание.РазделСчетаДепо;
		КонецЕсли;
		МестоХранения				= Основание.МХДепонента;
		СчетДЕПОМХ					= Основание.СчетДепоМХ;
		РазделСчетаДепоМХ			= Основание.РазделСчетаДепоМХ;
		Контрагент					= Основание.Контрагент;
		ДатаСделки					= Основание.ДатаСделки;
		Референс					= Основание.Референс;
		
		ИсточникДанныхЦБ = ?(ЗначениеЗаполнено(ДанныеЦБ), ДанныеЦБ, Основание);
		ЦБ = ИсточникДанныхЦБ.ЦБ;
		Цена = ИсточникДанныхЦБ.ЦенаСделкиЦБ;
		Если Не ДополнительныеСвойства.Свойство("ОставитьБезИзмененийКоличествоСуммуОперацииЦБ") Тогда
			Количество = ИсточникДанныхЦБ.КоличествоЦБ;
			Сумма = ИсточникДанныхЦБ.СуммаСделки;
		КонецЕсли;
		
		Если Основание.ВидОперацииД.КлассОпераций = Перечисления.КлассыОпераций.Инвентарные Тогда
			Залогодержатель			= Основание.Залогодержатель;
		КонецЕсли;
		
		ДатаИсполненияВДепозитарииМХ = Основание.ДатаИсполненияПорученияВДепозитарииМХ;
		ДатаИсполненияВМестеРасчетов = Основание.ДатаИсполненияПорученияВМестеРасчетов;
		
		ЗаполнениеРеквизитовПоВидуОперации();
		
	ИначеЕсли Основание.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания
		ИЛИ Основание.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		Дата = ?(ЗначениеЗаполнено(Основание.ДатаИсполненияПоручения), Основание.ДатаИсполненияПоручения, Основание.Дата);
		ДокументОснование			= Основание.Ссылка;	
		НомерВходящегоПоручения		= Основание.ВходящийНомерПоручения;
		ВидОперацииД				= Основание.ВидОперацииД;
		Комментарий					= "Поручение № " + Основание.Номер + " от " + Основание.Дата;
		Инициатор					= Основание.Инициатор;
		ЦБ							= Основание.ЦБ;
		ДатаСделки					= Основание.ДатаСделки;
		Референс					= Основание.Референс;
		ДатаИсполненияВДепозитарииМХ = Основание.ДатаИсполненияПорученияВДепозитарииМХ;
		ДатаИсполненияВМестеРасчетов = Основание.ДатаИсполненияПорученияВМестеРасчетов;
		
	Иначе
		Проверка = Истина;
		ДокументОснование = Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ 'Операции с ценными бумагами'.
		|'Класс операции' должен относиться к классу 'Инвентарных' или 'Комплексных' операций!
		|Либо 'Вид операции' должен быть 'Прием ЦБ на обслуживание' или 'Снятие ЦБ с обслуживания'");
		
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), , );
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДокументОснование = ДанныеЗаполнения.ДокументОснование;
		ДанныеЦБ = ДанныеЗаполнения;
	Иначе
		ДокументОснование = ДанныеЗаполнения;
		ДанныеЦБ = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЦБВПути") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование, , "Автор,Изменил,Комментарий,Дата,Номер,ДокументОснование");
		Если ЗначениеЗаполнено(ДокументОснование.ДокументОснование) Тогда
			Комментарий = "Поручение № " + СокрП(ДокументОснование.ДокументОснование.Номер) + " от " + ДокументОснование.ДокументОснование.Дата;
		КонецЕсли;		
		Дата = ОбщегоНазначения.ДатаДокумента(ДокументОснование);
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.иц_СводноеПоручение") Тогда
		Дата						= ДокументОснование.Дата;
		
		ДатаИсполненияВДепозитарииМХ = ДокументОснование.Дата;
		ДатаИсполненияВМестеРасчетов = ДокументОснование.Дата;
		
		СтрокаОснования				= ДокументОснование.СоставПоручения[НомерСтрокиОснования];
		ВидОперацииД				= СтрокаОснования.ВидОперацииД;
		Инициатор					= ДокументОснование.Инициатор;
		Депонент					= СтрокаОснования.Депонент;
		СчетДепо					= СтрокаОснования.СчетДепо;
		РазделСчетаДепо				= СтрокаОснования.РазделСчетаДепо;
		МестоХранения				= СтрокаОснования.МестоХранения;
		СчетДепоМХ					= СтрокаОснования.СчетДепоМХ;
		РазделСчетаДепоМХ			= СтрокаОснования.РазделСчетаДепоМХ;
		Контрагент					= СтрокаОснования.Контрагент;
		ЦБ							= СтрокаОснования.ЦеннаяБумага;
		Количество					= СтрокаОснования.Количество;
		Сумма						= СтрокаОснования.Сумма;
		Цена						= СтрокаОснования.Цена;
		СпособХранения				= СтрокаОснования.СпособХранения;
		Комментарий					= "Сводное поручение № " + ДокументОснование.Номер + " от " + ДокументОснование.Дата;
		Получатель					= СтрокаОснования.Получатель;
		СчетДепоПолучатель			= СтрокаОснования.СчетДепоПолучатель;
		РазделСчетаДепоПолучатель	= СтрокаОснования.РазделСчетаДепоПолучатель;
		МестоХраненияПолучатель		= СтрокаОснования.МестоХраненияПолучатель;
		СчетДепоМХПолучатель		= СтрокаОснования.СчетДепоМХПолучатель;
		РазделСчетаДепоМХПолучатель = СтрокаОснования.РазделСчетаДепоМХПолучатель;
		НомерВходящегоПоручения		= ДокументОснование.ВходящийНомерПоручения;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение")
		И ДокументОснование.ВидОперацииД = Справочники.ВидыОпераций.Перевод Тогда
		
		ЗаполнитьОперациюНаОснованииПорученияИСвязатьПоручения(ДокументОснование);
		
	Иначе
		
		ЗаполнитьОперациюНаОснованииПоручения(ДокументОснование, ДанныеЦБ);
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Выписка = Документы.Выписка.Выбрать(,,Новый Структура("ОперацияЦБ",Ссылка));
	Пока Выписка.Следующий() Цикл
		ДокВыписка = Выписка.ПолучитьОбъект();
		ДокВыписка.Удалить();
	КонецЦикла;
	// Удаление движений приемки / снятия ЦБ на обслуживании при соответствующем виде операций
	Если Ссылка.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание ИЛИ Ссылка.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		УдалитьСтарыйДвиженияПримекиСнятияОбслуживания();
	КонецЕсли;	
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		Документы.Поручение.ОтменитьПризнакНачислитьКомиссиюДепо(ДокументОснование, Ссылка);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОснованиеВстречный) Тогда
		Документы.Поручение.ОтменитьПризнакНачислитьКомиссиюДепо(ДокументОснованиеВстречный, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ЗаполнениеРеквизитовПоВидуОперации() Экспорт
	Если ВидОперацииД = ВидыОпераций.Перевод Тогда
		МестоХраненияПолучатель 	= ДокументОснование.МХКонтрагент;
		СчетДепоМХПолучатель		= ДокументОснование.СчетДепоМХКонтрагента;
		РазделСчетаДепоМХПолучатель = ДокументОснование.РазделСчетаДепоМХКонтрагента;
		// Дозаполняем данные для поручений на перевод ЦБ
		Получатель					= ДокументОснование.Контрагент;
		СчетДепоПолучатель			= ДокументОснование.СчетДепоКонтрагента;
		РазделСчетаДепоПолучатель	= ДокументОснование.РазделСчетаДепоКонтрагента;
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.Перемещение
		ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
		ИЛИ ВидОперацииД = ВидыОпераций.ПередачаВЗалог
		ИЛИ ВидОперацииД = ВидыОпераций.ВозвратИзЗалога Тогда
		Получатель					= ДокументОснование.Контрагент;
		СчетДепоПолучатель			= ДокументОснование.СчетДепоКонтрагента;
		РазделСчетаДепоПолучатель	= ДокументОснование.РазделСчетаДепоКонтрагента;
		МестоХраненияПолучатель 	= ДокументОснование.МХКонтрагент;
		СчетДепоМХПолучатель		= ДокументОснование.СчетДепоМХКонтрагента;
		РазделСчетаДепоМХПолучатель = ДокументОснование.РазделСчетаДепоМХКонтрагента;
	КонецЕсли;
КонецПроцедуры

Функция СтатусПоВидуОперации(ВидСтатуса, ВидОперации)
	
	Перем СтатусыЦБ;
	СтатусыЦБ = Перечисления.СтатусыЦБ;
	ЭтоПриход = ВидСтатуса = "ПРИХОД";
	
	Если ВидОперации = ВидыОпераций.Блокирование Тогда
		
		Возврат ?(ЭтоПриход, СтатусыЦБ.Блокирована, СтатусыЦБ.Свободна);
		
	ИначеЕсли ВидОперации = ВидыОпераций.ВозвратИзЗалога Тогда
		
		Возврат ?(ЭтоПриход, СтатусыЦБ.Свободна, СтатусыЦБ.Заложена);
		
	ИначеЕсли ВидОперации = ВидыОпераций.Обременение Тогда
		
		Возврат ?(ЭтоПриход, СтатусыЦБ.Обременена, СтатусыЦБ.Свободна);
		
	ИначеЕсли ВидОперации = ВидыОпераций.ПередачаВЗалог Тогда
		
		Возврат ?(ЭтоПриход, СтатусыЦБ.Заложена, СтатусыЦБ.Свободна);
		
	ИначеЕсли ВидОперации = ВидыОпераций.Разблокирование Тогда
		
		Возврат ?(ЭтоПриход, СтатусыЦБ.Свободна, СтатусыЦБ.Блокирована);
		
	ИначеЕсли ВидОперации = ВидыОпераций.СнятиеОбременения Тогда
		
		Возврат ?(ЭтоПриход, СтатусыЦБ.Свободна, СтатусыЦБ.Обременена);
		
	КонецЕсли;
	
КонецФункции

// Возвращает Истина, если остаток на счете по регистру ЦБВПути достаточен для списания.
// Иначе - Ложь.
Функция ДостаточноОстаткаПоЦБВПути(ВыбИзмерения, ВыбЗначение)
	ТекОстаток = РегистрыНакопления.ЦБВПути.Остатки(МоментВремени(), ВыбИзмерения,, "Количество");
	Возврат НЕ ( ТекОстаток.Количество() = 0 ИЛИ ТекОстаток.Итог("Количество") < ВыбЗначение );
КонецФункции

// Возвращает Истина, если остаток на счете по регистру ОстаткиЦБ достаточен для списания.
// Начиная с даты доп. движений также проверяются остатки по регистрам ОстаткиЦБДепозитарийМХ
// и ОстаткиЦБМестоРасчетов на соответствующие даты.
// Если хотя бы по одному регистру остатка не достаточно, возвращает Ложь и заполненный ШаблонОшибки.
Функция ДостаточноОстаткаПоРегистрамОстаткиЦБ(ВыбИзмерения, ВыбЗначение, ШаблонОшибки)
	
	Если ВыбЗначение = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ШаблонОшибки = "Количество списания {Кол} превышает остаток {Ост} на счете клиента (регистр ""{ИмяРег}"" на {Дата})
		|ЦБ: {ЦБ}  ISIN: {ISIN}
		|Счет ДЕПО: {СчетДепо}
		|Раздел счета ДЕПО: {РазделСчетаДепо}
		|Счет ДЕПО места хранения: {СчетДепоМХ}
		|Раздел счета ДЕПО места хранения: {РазделСчетаДепоМХ}";
	
	ОстатокЦБ = РегистрыНакопления.ОстаткиЦБ.Остатки(МоментВремени(), ВыбИзмерения,, "Количество");
	ОстатковДостаточно = ДостаточноОстатковПоТаблице(ОстатокЦБ, ВыбЗначение, ШаблонОшибки, 
		Метаданные.РегистрыНакопления.ОстаткиЦБ.Синоним, Дата);
		
	Если ОстатковДостаточно И ВидОперацииД.ДвижениеПоЦБ Тогда // Нужно проверять дополнительные регистры
		
		ДатаВремяМХ = ОбъединениеДатыВремени(ДатаИсполненияВДепозитарииМХ, Дата);
		ОстатокМХ = РегистрыНакопления.ОстаткиЦБДепозитарийМХ.Остатки(Новый Граница(ДатаВремяМХ, ВидГраницы.Включая), ВыбИзмерения,, "Количество");
		ОстатковДостаточно = ДостаточноОстатковПоТаблице(ОстатокМХ, ВыбЗначение, ШаблонОшибки, 
			Метаданные.РегистрыНакопления.ОстаткиЦБДепозитарийМХ.Синоним, ДатаВремяМХ);
			
		Если ОстатковДостаточно Тогда
			ДатаВремяМР = ОбъединениеДатыВремени(ДатаИсполненияВМестеРасчетов, Дата);
			ОстатокМР = РегистрыНакопления.ОстаткиЦБМестоРасчетов.Остатки(Новый Граница(ДатаВремяМР, ВидГраницы.Включая), ВыбИзмерения,, "Количество");
			ОстатковДостаточно = ДостаточноОстатковПоТаблице(ОстатокМР, ВыбЗначение, ШаблонОшибки, 
				Метаданные.РегистрыНакопления.ОстаткиЦБМестоРасчетов.Синоним, ДатаВремяМР);
		КонецЕсли;
	КонецЕсли;
	
	// Дополнительный контроль остатков ЦБ по статусам
	Если ОстатковДостаточно
		И (ВидОперацииД = ВидыОпераций.СнятиеСДепонирования
			ИЛИ ВидОперацииД = ВидыОпераций.Перевод
			ИЛИ ВидОперацииД = ВидыОпераций.Перемещение
			ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
			ИЛИ ВидОперацииД = ВидыОпераций.Блокирование
			ИЛИ ВидОперацииД = ВидыОпераций.Обременение
			ИЛИ ВидОперацииД = ВидыОпераций.ПередачаВЗалог) Тогда
		
		ШаблонОшибки = "Количество списания {Кол} превышает свободный остаток или сумму свободного и обремененного остатков
			|на счете клиента (регистр ""{ИмяРег}"" на {Дата})
			|ЦБ: {ЦБ} ISIN: {ISIN}
			|Счет ДЕПО: {СчетДепо}
			|Раздел счета ДЕПО: {РазделСчетаДепо}
			|Счет ДЕПО места хранения: {СчетДепоМХ}
			|Раздел счета ДЕПО места хранения: {РазделСчетаДепоМХ}";
	
		ОстатковДостаточно = ДостаточноОстатковПоСтатусам(ОстатокЦБ, ВыбЗначение, ШаблонОшибки, 
			Метаданные.РегистрыНакопления.ОстаткиЦБ.Синоним, Дата);
		Если ОстатковДостаточно И ВидОперацииД.ДвижениеПоЦБ Тогда // Нужно проверять дополнительные регистры
			
			ОстатковДостаточно = ДостаточноОстатковПоСтатусам(ОстатокМХ, ВыбЗначение, ШаблонОшибки, 
				Метаданные.РегистрыНакопления.ОстаткиЦБДепозитарийМХ.Синоним, ОбъединениеДатыВремени(ДатаИсполненияВДепозитарииМХ, Дата));
				
			Если ОстатковДостаточно Тогда
				ОстатковДостаточно = ДостаточноОстатковПоСтатусам(ОстатокМР, ВыбЗначение, ШаблонОшибки, 
					Метаданные.РегистрыНакопления.ОстаткиЦБМестоРасчетов.Синоним, ОбъединениеДатыВремени(ДатаИсполненияВМестеРасчетов, Дата));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Общие параметры для шаблонов
	ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{ЦБ}",				ВыбИзмерения.ЦБ);
	ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{ISIN}",				ВыбИзмерения.ЦБ.ISIN);
	ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{СчетДепо}",			ВыбИзмерения.СчетДепо);
	ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{РазделСчетаДепо}",	ВыбИзмерения.РазделСчетаДепо);
	ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{СчетДепоМХ}",		ВыбИзмерения.СчетДепоМХ);
	ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{РазделСчетаДепоМХ}",	ВыбИзмерения.РазделСчетаДепоМХ);
	
	Возврат ОстатковДостаточно;
	
КонецФункции

Функция ДостаточноОстатковПоТаблице(Остаток, ВыбЗначение, ШаблонОшибки, ИмяРег, Дата)
	Если Остаток.Количество() = 0 ИЛИ Остаток.Итог("Количество") < ВыбЗначение Тогда
		ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Кол}",	ВыбЗначение);		
		ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Ост}",	Остаток.Итог("Количество"));
		ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{ИмяРег}",ИмяРег);
		ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Дата}",	Дата);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ДостаточноОстатковПоСтатусам(ТабОстатков, ВыбЗначение, ШаблонОшибки, ИмяРег, Дата)
	ОстаткиСвободна = 0;
	ОстаткиОбременена = 0;
	Для каждого СтрокаОстаток Из ТабОстатков Цикл
		Если СтрокаОстаток.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна Тогда
			ОстаткиСвободна = СтрокаОстаток.Количество;
		КонецЕсли;
		Если СтрокаОстаток.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена Тогда
			ОстаткиОбременена = СтрокаОстаток.Количество;
		КонецЕсли;
	КонецЦикла; 

	Если ОстаткиСвободна + ОстаткиОбременена < ВыбЗначение
		ИЛИ ОстаткиСвободна < ВыбЗначение Тогда
		ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Кол}",	ВыбЗначение);		
		ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{ИмяРег}",ИмяРег);
		ШаблонОшибки = СтрЗаменить(ШаблонОшибки, "{Дата}",	Дата);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ЕстьОшибки()
	
	ЕстьОшибка = Ложь;
	ТекстОшибки = "";
	КолСписЦБСОбрем = 0;
	
	Измерения = Новый Структура("СчетДепо, РазделСчетаДепо, СчетДепоМХ, РазделСчетаДепоМХ, ЦБ",
		СчетДепо, РазделСчетаДепо, СчетДепоМХ, РазделСчетаДепоМХ, ЦБ);
		
	ИзмеренияСоСтатусомЦБ = Новый Структура("СчетДепо, РазделСчетаДепо, СчетДепоМХ, РазделСчетаДепоМХ, ЦБ, СтатусЦБ",
		СчетДепо, РазделСчетаДепо, СчетДепоМХ, РазделСчетаДепоМХ, ЦБ, СтатусПоВидуОперации("РАСХОД", ВидОперацииД));
		
	ИзмеренияПолучатель = Новый Структура("СчетДепо, РазделСчетаДепо, СчетДепоМХ, РазделСчетаДепоМХ, ЦБ",
		СчетДепоПолучатель, РазделСчетаДепоПолучатель, СчетДепоМХПолучатель, РазделСчетаДепоМХПолучатель, ЦБ);
	
	Если ВидОперацииД = ВидыОпераций.Депонирование ИЛИ 
		ВидОперацииД = ВидыОпераций.НачислениеДоходовЦБ Тогда
		
		Если СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя закрыт!", ЕстьОшибка);
			
		ИначеЕсли СчетДепо.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя не открыт!", ЕстьОшибка);
		КонецЕсли;
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЦБВПути") Тогда
			Если НЕ ДостаточноОстаткаПоЦБВПути(Измерения, Количество) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Количество списания превышает остаток на счете клиента (в пути)!", ЕстьОшибка);
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.СнятиеСДепонирования Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЦБВПути") Тогда
			Если НЕ ДостаточноОстаткаПоЦБВПути(Измерения, Количество) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Количество списания превышает остаток на счете клиента (в пути)!", ЕстьОшибка);
			КонецЕсли;	
		ИначеЕсли РасчетыНаDMA Тогда
			Если Не ДостаточноОстаткаПоРегистрамОстаткиЦБ(Измерения, Количество - ЗаблокированноеКоличествоЦБ, ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, ЕстьОшибка);
			КонецЕсли;	
		Иначе
			Если НЕ ДостаточноОстаткаПоРегистрамОстаткиЦБ(Измерения, Количество, ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, ЕстьОшибка);
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.Перевод Тогда
		Если СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя закрыт!", ЕстьОшибка);
			
		ИначеЕсли СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя не открыт!", ЕстьОшибка);
		КонецЕсли;		
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЦБВПути") Тогда
			Если НЕ ДостаточноОстаткаПоЦБВПути(ИзмеренияПолучатель, Количество) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Количество списания превышает остаток на счете клиента (в пути)!", ЕстьОшибка);
			КонецЕсли;
			
		Иначе
			Если НЕ ДостаточноОстаткаПоРегистрамОстаткиЦБ(Измерения, Количество, ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, ЕстьОшибка);
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.Перемещение
				ИЛИ ВидОперацииД = ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЦБВПути") Тогда
			Если НЕ ДостаточноОстаткаПоЦБВПути(ИзмеренияПолучатель, Количество) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Количество списания превышает остаток на счете клиента (в пути)!", ЕстьОшибка);
			КонецЕсли;	
			
		Иначе
			Если НЕ ДостаточноОстаткаПоРегистрамОстаткиЦБ(Измерения, Количество, ТекстОшибки) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, ЕстьОшибка);
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.Блокирование 
		ИЛИ ВидОперацииД = ВидыОпераций.Обременение
		ИЛИ ВидОперацииД = ВидыОпераций.ПередачаВЗалог Тогда
		
		Если СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя закрыт!", ЕстьОшибка);
			
		ИначеЕсли СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя не открыт!", ЕстьОшибка);
		КонецЕсли;		
		
		Если НЕ ДостаточноОстаткаПоРегистрамОстаткиЦБ(Измерения, Количество, ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, ЕстьОшибка);
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.ВозвратИзЗалога
		ИЛИ ВидОперацииД = ВидыОпераций.Разблокирование
		ИЛИ ВидОперацииД = ВидыОпераций.СнятиеОбременения Тогда
		
		Если СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.Закрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя закрыт!", ЕстьОшибка);
			
		ИначеЕсли СчетДепоПолучатель.СтатусСчетаДепо = Перечисления.СтатусыСчетовДепо.НеОткрыт Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Счет депо получателя не открыт!", ЕстьОшибка);
		КонецЕсли;		
		
		Если НЕ ДостаточноОстаткаПоРегистрамОстаткиЦБ(ИзмеренияСоСтатусомЦБ, Количество, ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, ЕстьОшибка);
		КонецЕсли;
		
	ИначеЕсли ВидОперацииД = ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		// Без проверки
	ИначеЕсли ВидОперацииД = ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		// Без проверки
	ИначеЕсли ВидОперацииД = ВидыОпераций.Выкуп Тогда
		Если НЕ ДостаточноОстаткаПоРегистрамОстаткиЦБ(Измерения, Количество, ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, ЕстьОшибка);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Данная операция документом ""Операция с ЦБ"" не производится!", ЕстьОшибка);
	КонецЕсли;		
	
	Возврат ЕстьОшибка;
	
КонецФункции


Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
	
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	// Удаление движений приемки / снятия ЦБ на обслуживании при соответствующем виде операций
	Если (Ссылка.ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание ИЛИ Ссылка.ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания) И Ссылка.Проведен Тогда
		УдалитьСтарыйДвиженияПримекиСнятияОбслуживания();
	КонецЕсли;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		Документы.Поручение.ОтменитьПризнакНачислитьКомиссиюДепо(ДокументОснование, Ссылка);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОснованиеВстречный) Тогда
		Документы.Поручение.ОтменитьПризнакНачислитьКомиссиюДепо(ДокументОснованиеВстречный, Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьСтарыйДвиженияПримекиСнятияОбслуживания()
	Если ВидОперацииД = Справочники.ВидыОпераций.ПриемЦБНаОбслуживание Тогда
		ЦБОбъект	= ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаПриемаНаОбслуживание		= Дата(1,1,1);
		ЦБОбъект.ДокументПриемаНаОбслуживание	= Документы.ОперацииЦБ.ПустаяСсылка();
		ЦБОбъект.Записать();
	ИначеЕсли ВидОперацииД = Справочники.ВидыОпераций.СнятиеЦБсОбслуживания Тогда
		ЦБОбъект	= ЦБ.ПолучитьОбъект();
		ЦБОбъект.ДатаСнятияСОбслуживания		= Дата(1,1,1);
		ЦБОбъект.ДокументСнятияСОбслуживания	= Документы.ОперацииЦБ.ПустаяСсылка();
		ЦБОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

// Добавляет движения в регистр накопления ОстаткиЦБ, а для видов операции с установленным флажком ДвижениеПоЦБ
// с определенной даты также и в регистры накопления ОстаткиЦБДепозитарийМХ и ОстаткиЦБМестоРасчетов.
// При этом в движениях по этим регистрам в качестве периода используются ДатаИсполненияВДепозитарииМХ
// и ДатаИсполненияВМестеРасчетов соответственно (из этих реквизитов берется дата, из "Дата" берется время).
Процедура ДобавитьДвиженияВОстаткиЦБ(ВидДвижения, СтатусЦБ, Количество, ПоРеквизитамПолучателям = Ложь, пРазделСчетаДепо = Неопределено)
	Если ПоРеквизитамПолучателям Тогда
		пСчетДепо			= СчетДепоПолучатель;
		пРазделСчетаДепо	= РазделСчетаДепоПолучатель;
		пСчетДепоМХ			= СчетДепоМХПолучатель;
		пРазделСчетаДепоМХ	= РазделСчетаДепоМХПолучатель;
	Иначе
		пСчетДепо			= СчетДепо;
		Если пРазделСчетаДепо = Неопределено Тогда
			пРазделСчетаДепо	= РазделСчетаДепо;
		КонецЕсли;
		пСчетДепоМХ			= СчетДепоМХ;
		пРазделСчетаДепоМХ	= РазделСчетаДепоМХ;
	КонецЕсли;
		
	Движение = Движения.ОстаткиЦБ.Добавить(); 
	Движение.ВидДвижения		= ВидДвижения;
	Движение.Период				= Дата;		// По основному регистру движение делается на дату документа
	Движение.СчетДепо			= пСчетДепо;
	Движение.РазделСчетаДепо	= пРазделСчетаДепо;
	Движение.ЦБ					= ЦБ;
	Движение.СчетДепоМХ			= пСчетДепоМХ;
	Движение.РазделСчетаДепоМХ	= пРазделСчетаДепоМХ;
	Движение.СтатусЦБ			= СтатусЦБ;
	Движение.Количество			= Количество;
	
	Если ВидОперацииД.ДвижениеПоЦБ Тогда
		Движение = Движения.ОстаткиЦБДепозитарийМХ.Добавить(); 
		Движение.ВидДвижения		= ВидДвижения;
		Движение.Период				= ОбъединениеДатыВремени(ДатаИсполненияВДепозитарииМХ, Дата);	// Дата - специальная дата, время - из стандартной даты
		Движение.СчетДепо			= пСчетДепо;
		Движение.РазделСчетаДепо	= пРазделСчетаДепо;
		Движение.ЦБ					= ЦБ;
		Движение.СчетДепоМХ			= пСчетДепоМХ;
		Движение.РазделСчетаДепоМХ	= пРазделСчетаДепоМХ;
		Движение.СтатусЦБ			= СтатусЦБ;
		Движение.Количество			= Количество;
		
		Движение = Движения.ОстаткиЦБМестоРасчетов.Добавить(); 
		Движение.ВидДвижения		= ВидДвижения;
		Движение.Период				= ОбъединениеДатыВремени(ДатаИсполненияВМестеРасчетов, Дата);	// Дата - специальная дата, время - из стандартной даты
		Движение.СчетДепо			= пСчетДепо;
		Движение.РазделСчетаДепо	= пРазделСчетаДепо;
		Движение.ЦБ					= ЦБ;
		Движение.СчетДепоМХ			= пСчетДепоМХ;
		Движение.РазделСчетаДепоМХ	= пРазделСчетаДепоМХ;
		Движение.СтатусЦБ			= СтатусЦБ;
		Движение.Количество			= Количество;
	КонецЕсли;
КонецПроцедуры

// Обертка для процедуры ДобавитьДвиженияВОстаткиЦБ
// Вызывается, если нужно сделать движения по реквизитам-получателям
Процедура ДобавитьДвиженияВОстаткиЦБПолучатель(ВидДвижения, СтатусЦБ, Количество)
	ДобавитьДвиженияВОстаткиЦБ(ВидДвижения, СтатусЦБ, Количество, Истина);
КонецПроцедуры

Процедура ЗаписатьДвиженияОстатковЦБ()
	Движения.ОстаткиЦБ.Записать();
	Если ВидОперацииД.ДвижениеПоЦБ Тогда
		Движения.ОстаткиЦБДепозитарийМХ.Записать();
		Движения.ОстаткиЦБМестоРасчетов.Записать();
	КонецЕсли;
КонецПроцедуры

// Возвращает значение, содержащее дату и время из соответствующих источников
Функция ОбъединениеДатыВремени(ИсточникДаты, ИсточникВремени)
	Возврат Дата(Год(ИсточникДаты), Месяц(ИсточникДаты), День(ИсточникДаты),
		Час(ИсточникВремени), Минута(ИсточникВремени), Секунда(ИсточникВремени));
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	ИсключитьИзОбменаДанными = Ложь;
КонецПроцедуры

Процедура ЗаполнитьДатыИсполненияВПоручении(ДокументПоручение, Отказ)
	Если ТипЗнч(ДокументПоручение) <> Тип("ДокументСсылка.Поручение") Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В основании должен быть указан документ 'Поручение'", Отказ);
		Возврат;
	КонецЕсли;
	
	Если ДокументПоручение.ВидОперацииД <> Справочники.ВидыОпераций.Перевод Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Документ-основание и документ-основание (встречный) должны иметь вид операции 'Перевод'", Отказ);
		Возврат;
	КонецЕсли;
	
	ДокОбъект = ДокументПоручение.ПолучитьОбъект();
	ДокОбъект.ДатаИсполненияПоручения = Дата;

	Если ВидОперацииД.ДвижениеПоЦБ Тогда
		ДокОбъект.ДатаИсполненияПорученияВДепозитарииМХ = ДатаИсполненияВДепозитарииМХ;
		ДокОбъект.ДатаИсполненияПорученияВМестеРасчетов = ДатаИсполненияВМестеРасчетов;
	КонецЕсли;
	ДокОбъект.ДополнительныеСвойства.Вставить("ОперацияЦБ",Ссылка);
	ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
КонецПроцедуры

Функция РазделСчетаДепоПоСтруктуреПодчиненностиПоручения(Основание)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Поручение.Ссылка КАК Поручение
	|ПОМЕСТИТЬ втПоручениеНаПеревод
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Проведен
	|	И Поручение.ДокументОснование = &Основание
	|	И Поручение.ВидОперацииД = &ПереводМеждуРазделами
	|;
	|/////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Операция.РазделСчетаДепоПолучатель КАК БлокировочныйРаздел
	|ИЗ
	|	Документ.ОперацииЦБ КАК Операция
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоручениеНаПеревод КАК ПоручениеНаПеревод
	|	ПО Операция.ДокументОснование = ПоручениеНаПеревод.Поручение
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.РазделСчетаДепоПолучатель.ТипРазделаСчетаДЕПО = &БлокированоРасчеты
	|");
	Запрос.УстановитьПараметр("Основание",				Основание);
	Запрос.УстановитьПараметр("ПереводМеждуРазделами",	Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	Запрос.УстановитьПараметр("БлокированоРасчеты",		Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.БлокировочныйРаздел;
	Иначе
		Возврат Основание.РазделСчетаДепо;
	КонецЕсли;
КонецФункции

Процедура СформироватьДвиженияПоРегиструЗаблокированныеЦБ(Отказ)
	
	Если ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
		Или ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииЦБ.РазделСчетаДепо.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДЕПО,
		|	ОперацииЦБ.РазделСчетаДепоПолучатель.ТипРазделаСчетаДЕПО КАК ТипРазделаСчетаДЕПОПолучатель,
		|	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ПоручениеСписание.Дата, ПоручениеПереводОснование.Дата),
		|		ПоручениеПереводПоОтмене.ДокументОснование.ОтменяемоеПоручение.Дата), ДАТАВРЕМЯ(1, 1, 1)) КАК ПоручениеДата
		|ИЗ
		|	Документ.ОперацииЦБ КАК ОперацииЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеСписание
		|		ПО ОперацииЦБ.ДокументОснование = ПоручениеСписание.Ссылка
		|			И (ПоручениеСписание.ВидОперацииД = &СнятиеСДепонирования)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеПеревод
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеПереводОснование
		|			ПО ПоручениеПеревод.ДокументОснование = ПоручениеПереводОснование.Ссылка
		|				И (ПоручениеПереводОснование.ВидОперацииД = &СнятиеСДепонирования)
		|		ПО ОперацииЦБ.ДокументОснование = ПоручениеПеревод.Ссылка
		|			И (ПоручениеПеревод.ВидОперацииД = &ПереводМеждуРазделамиСчетаДепо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеПереводПоОтмене
		|		ПО ОперацииЦБ.ДокументОснование = ПоручениеПереводПоОтмене.Ссылка
		|			И (ПоручениеПереводПоОтмене.ВидОперацииД = &ПереводМеждуРазделамиСчетаДепо)
		|			И (ПоручениеПереводПоОтмене.ДокументОснование.ВидОперацииД = &ОтменаПоручения)
		|			И (ПоручениеПереводПоОтмене.ДокументОснование.ОтменяемоеПоручение.ВидОперацииД = &СнятиеСДепонирования)
		|ГДЕ
		|	ОперацииЦБ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("СнятиеСДепонирования", Справочники.ВидыОпераций.СнятиеСДепонирования);
		Запрос.УстановитьПараметр("ПереводМеждуРазделамиСчетаДепо", Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
		Запрос.УстановитьПараметр("ОтменаПоручения", Справочники.ВидыОпераций.ОтменаПоручения);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ТипыРазделовСчетовДЕПО = Перечисления.ТипыРазделовСчетовДЕПО;
		
		Если ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
			И Выборка.ТипРазделаСчетаДЕПОПолучатель = ТипыРазделовСчетовДЕПО.БлокированоРасчеты Тогда
			ВидДвижения = ВидДвиженияНакопления.Приход;
		ИначеЕсли Выборка.ТипРазделаСчетаДЕПО = ТипыРазделовСчетовДЕПО.БлокированоРасчеты
			Или ЗначениеЗаполнено(БлокировочныйРазделСчетаДепо) Тогда
			ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		
		ДатаПереходаНаНовыйМеханизмБлокировокЦБ =
			РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("5577.ДатаПереходаНаНовыйМеханизмБлокировокЦБ");
			
		Если ЗначениеЗаполнено(ДатаПереходаНаНовыйМеханизмБлокировокЦБ)
			И Выборка.ПоручениеДата >= ДатаПереходаНаНовыйМеханизмБлокировокЦБ Тогда
			
			Если ВидДвижения = ВидДвиженияНакопления.Расход Тогда
				ВыполнитьКонтрольОтрицательныхОстатковПоРегиструЗаблокированныеЦБ(Отказ, ТекущаяДатаСеанса());
			КонецЕсли;
			
		Иначе
			
			Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				
				МХКонтрагент = МХКонтрагентОснованияВторогоУровня();
				Если ЗначениеЗаполнено(МХКонтрагент) И МХКонтрагент <> Константы.МестоХраненияПоУмолчанию.Получить() Тогда
					Движение = Движения.ЗаблокированныеЦБвВышестоящемДепозитарии.Добавить();
					Движение.ВидДвижения					= ВидДвижения;
					Движение.Период							= Дата;
					Движение.ЦеннаяБумага					= ЦБ;
					Движение.СчетДепо						= СчетДепоПолучатель;
					Движение.МестоХранения					= МестоХраненияПолучатель;
					Движение.СчетДепоМХ						= СчетДепоМХПолучатель;
					Движение.РазделСчетаДепоМХ				= РазделСчетаДепоМХПолучатель;
					Движение.БлокировочныйРазделСчетаДепоМХ	= СчетДепоМХПолучатель.БлокировочныйРазделСчета;
					Движение.Количество						= Количество;
				КонецЕсли;
				
			ИначеЕсли ВидДвижения = ВидДвиженияНакопления.Расход Тогда
				
				Если ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо Тогда
					МХКонтрагент = МХКонтрагентОтменяемогоПоручения();
				Иначе
					МХКонтрагент = МХКонтрагентОснования();
				КонецЕсли;
				
				Если ЗначениеЗаполнено(МХКонтрагент) И МХКонтрагент <> Константы.МестоХраненияПоУмолчанию.Получить() Тогда
					Движение = Движения.ЗаблокированныеЦБвВышестоящемДепозитарии.Добавить();
					Движение.ВидДвижения					= ВидДвижения;
					Движение.Период							= Дата;
					Движение.ЦеннаяБумага					= ЦБ;
					Движение.СчетДепо						= СчетДепо;
					Движение.МестоХранения					= МестоХранения;
					Движение.СчетДепоМХ						= СчетДепоМХ;
					Движение.РазделСчетаДепоМХ				= РазделСчетаДепоМХ;
					Движение.БлокировочныйРазделСчетаДепоМХ	= СчетДепоМХ.БлокировочныйРазделСчета;
					Движение.Количество						= ЗаблокированноеКоличествоЦБ;
					
					Движения.ЗаблокированныеЦБвВышестоящемДепозитарии.Записывать = Истина;
					Движения.ЗаблокированныеЦБвВышестоящемДепозитарии.Записать();
					
					ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
					ВыполнитьКонтрольОтрицательныхОстатковПоРегиструЗаблокированныеЦБ(Отказ, ГраницаКонтроля);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаблокированноеКоличествоЦБ()
	Если Не РасчетыНаDMA Тогда
		Возврат Количество;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НеттоПоручение.Ссылка КАК Ссылка,
	|	НеттоПоручение.ВидОперации КАК ВидОперации,
	|	НеттоПоручение.Количество КАК Количество
	|ИЗ
	|	Документ.НеттоПоручение КАК НеттоПоручение
	|ГДЕ
	|	НеттоПоручение.Поручения.Поручение = &Поручение";
	Запрос.УстановитьПараметр("Поручение", ДокументОснование);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Количество;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если Выборка.ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		Возврат Выборка.Количество;
	Иначе // такого не долно случиться, поэтому возвращаем заведомо невыполнимое количество, которое приведёт к ошибке проведения
		Возврат Количество;
	КонецЕсли;
КонецФункции

Функция МХКонтрагентОснованияВторогоУровня()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(Поручение.ДокументОснование КАК Документ.Поручение).МХКонтрагент, &ПустоеМХ) КАК МХКонтрагент
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ПустоеМХ", Справочники.МестаХранения.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МХКонтрагент;
	Иначе
		Возврат Запрос.Параметры.ПустоеМХ;
	КонецЕсли;	
КонецФункции

Функция МХКонтрагентОснования()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Поручение.МХКонтрагент КАК МХКонтрагент
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МХКонтрагент;
	Иначе
		Возврат Справочники.МестаХранения.ПустаяСсылка();
	КонецЕсли;	
КонецФункции

Функция МХКонтрагентОтменяемогоПоручения()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫРАЗИТЬ(Поручение.ДокументОснование КАК Документ.Поручение).ОтменяемоеПоручение КАК Документ.Поручение).МХКонтрагент, &ПустоеМХ) КАК МХКонтрагент
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ПустоеМХ", Справочники.МестаХранения.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МХКонтрагент;
	Иначе
		Возврат Запрос.Параметры.ПустоеМХ;
	КонецЕсли;	
КонецФункции

Процедура ВыполнитьКонтрольОтрицательныхОстатковПоРегиструЗаблокированныеЦБ(Отказ, ГраницаКонтроля)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	-Остатки.КоличествоОстаток КАК Дефицит
	|ИЗ
	|	РегистрНакопления.ЗаблокированныеЦБвВышестоящемДепозитарии.Остатки(
	|			&ГраницаКонтроля,
	|			ЦеннаяБумага = &ЦеннаяБумага
	|				И СчетДепо = &СчетДепо
	|				И МестоХранения = &МестоХранения
	|				И СчетДепоМХ = &СчетДепоМХ
	|				И РазделСчетаДепоМХ = &РазделСчетаДепоМХ
	|				И БлокировочныйРазделСчетаДепоМХ = &БлокировочныйРазделСчетаДепоМХ) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток < 0");
	
	Запрос.УстановитьПараметр("ГраницаКонтроля",	ГраницаКонтроля);
	Запрос.УстановитьПараметр("ЦеннаяБумага",		ЦБ);
	Запрос.УстановитьПараметр("СчетДепо",			СчетДепо);
	Запрос.УстановитьПараметр("МестоХранения",		МестоХранения);
	Запрос.УстановитьПараметр("СчетДепоМХ",			СчетДепоМХ);
	Запрос.УстановитьПараметр("РазделСчетаДепоМХ",	РазделСчетаДепоМХ);
	Запрос.УстановитьПараметр("БлокировочныйРазделСчетаДепоМХ", СчетДепоМХ.БлокировочныйРазделСчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Текст = "Недостаточно ЦБ в количестве " + Выборка.Дефицит + " шт. для списания по регистру заблокированных ЦБ.";
		ОбщегоНазначения.СообщитьОбОшибке(Текст, Отказ);
		ЗаписьЖурналаРегистрации("Проведение по регистру ""Заблокированные ЦБ в НРД""",
			УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка, Текст);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ВидыОпераций	= Справочники.ВидыОпераций;
